// Задание 2. Крестики-нолики
// Что нужно сделать
// Старая добрая игра на страницах всех школьных тетрадей. Поле размером 3 × 3
// представлено в виде двумерного массива с типом элементов char. Участвуют два игрока,
// они ходят по очереди и ставят в указанные ими в стандартном вводе координаты свой
// символ — X или O (буквы латинского алфавита). Как только у одного из игроков будет
// установлено подряд три крестика или три нолика, он побеждает. Если свободных клеток
// не осталось, а трёх совпадающих элементов не найдено, то объявляется ничья.

// Для простоты не будем рассматривать диагональные совпадения — только строго
// вертикальные и строго горизонтальные.

// Изначально всё поле инициализируется символом пробела — ‘ ‘(для обозначения пробела
// кавычки одинарные и в одну сторону). Это можно сделать сразу при объявлении либо с
// помощью вложенного цикла. На каждом ходе при занятой клетке или при неверных
// координатах этой клетки должно быть выведено сообщение, и игрок должен указать
// координаты клетки повторно. После каждого хода надо выводить в консоль текущее
// состояние всего игрового поля для наглядности.

// Советы и рекомендации
// Действия для обоих игроков одинаковые, отличаются только символом, который ставится
// на поле.
// Игровой цикл не должен быть бесконечным. Игра имеет определённое максимальное
// количество шагов.
// Не забывайте про случай ничьей.
// Как и в предыдущем задании, здесь будет удобно сразу заполнить массив значениями
// false. Количество мест, доступных для заполнения, заранее известно. В процессе
// заполнения из этой переменой нужно не забывать вычитать единицу. Чтобы отметить
// место как занятое, нужно лишь написать places[i][j] = true;.
// Проверку на победу игрока, которую надо осуществлять после каждого хода, можно
// сделать с помощью вложенного цикла, сразу проверяя и вертикаль, и горизонталь, а как
// именно — попробуйте догадаться сами.
// Здесь заранее известно число ходов — 3 * 3. Столько раз должен быть выполнен цикл,
// который спрашивает у очередного игрока координаты.
// Символ, который будет установлен в указанных координатах, можно на каждом шаге
// менять подобным образом:
// if (gamer_name == 'X')
//                 gamer_name = 'O';
// else
//                 gamer_name = 'X';

// Что оценивается
// Корректный ход игры, соответствующий правилам.
// Правильный (желательно красивый) вывод игрового поля.
// Понятный игроку интерфейс.

#include <iostream>
#include <vector>

void print(char places[3][3])
{
    int y = 1;
    std::cout << "  1   2   3\n";
    for (int i = 0; i < 7; i++)
    {
        for (int j = 0; j < 7; j++)
        {
            if (!(i % 2))
            {
                if (j == 6)
                    std::cout << "*";
                else
                    std::cout << "**";
            }
            else if (!(j % 2))
                std::cout << "*";
            else
                std::cout << " " << places[i / 2][j / 2] << " ";
        }
        if (i % 2)
        {
            std::cout << " " << y;
            y++;
        }
        std::cout << "\n";
    }
}

bool check(char places[3][3], bool spaces[3][3])
{
    for (int i = 0; i < 3; i++)
    {
        if ((spaces[i][0] == true &&
             spaces[i][0] == spaces[i][1] && spaces[i][1] == spaces[i][2] &&
             places[i][0] == places[i][1] && places[i][1] == places[i][2])
              ||
            (spaces[0][i] == true &&
             spaces[0][i] == spaces[1][i] && spaces[1][i] == spaces[2][i] &&
             places[0][i] == places[1][i] && places[1][i] == places[2][i]))
            return true;
    }
    return false;
}

int main()
{
    char places[3][3]{{' ', ' ', ' '}, {' ', ' ', ' '}, {' ', ' ', ' '}};
    bool spaces[3][3]{{0, 0, 0}, {0, 0, 0}, {0, 0, 0}};
    char gamer_name = 'X';
    int count = 1;
    int x, y;

    while (count <= 9)
    {
        std::cout << "Ход игрока " << gamer_name << "\n";
        std::cout << "Введите координаты X и Y: \n";
        std::cin >> x >> y;

        x--;
        y--;

        if (x < 0 && x > 2)
        {
            std::cout << "Ошибка! X должен быть в пределах от 1 до 3.\n";
            continue;
        }

        if (y < 0 && y > 2)
        {
            std::cout << "Ошибка! Y должен быть в пределах от 1 до 3.\n";
            continue;
        }

        if (spaces[y][x] == true)
        {
            std::cout << "Ошибка! Эта клетка уже занята.\n";
            continue;
        }
        else
        {
            spaces[y][x] = true;
            count++;
            places[y][x] = gamer_name;

            print(places);

            if (check(places, spaces))
            {
                std::cout << "\nПоздравляем! Выиграл игрок - " << gamer_name << "\n";
                break;
            }

            if (gamer_name == 'X')
                gamer_name = 'O';
            else
                gamer_name = 'X';
        }

        if (count == 9)
            std::cout << "Ничья!\n";
    }
}